/***********************************************************************************************************************
* Copyright (c) , CVTE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
 文件 : Canbus_EmsParallel_COMData.h 
 用途 : CanbusEms并机协议协议数据头文件
***********************************************************************************************************************/
#ifndef _CANBUS_EMSPARALLEL_COMDATA_H_
#define _CANBUS_EMSPARALLEL_COMDATA_H_

#include "HeadFile.h"
#include "MCU.h"

extern void EMSCan_SendPacket(void);
extern void EMSCan_ReceivePacket(void);

#endif
/***********************************************************************************************************************
* * Copyright (c) , CVTE All rights reserved.  * * * END OF FILE
***********************************************************************************************************************/

